Repository: lequan310/Sudoku
Catalog: Sudoku/*.lproj/Localizable.strings
Languages: vi

source: New Game
vi: Game Mới

source: Resume
vi: Tiếp Tục

source: Leaderboard
vi: Xếp Hạng

source: How To Play
vi: Hướng Dẫn

source: Settings
vi: Cài Đặt

source: Back
vi: Trở lại

source: Player Name
vi: Tên Người Chơi

source: Difficulty
vi: Độ Khó

# difficulty.description
source: Select difficulty of the game
vi: Chọn độ khó của game

source: Easy
vi: Dễ

source: Medium
vi: Thường

source: Hard
vi: Khó

source: Dark Mode
vi: Chế Độ Tối

# darkmode.description
source: Toggle the current theme to light or dark
vi: Thay đổi giữa chế độ nền sáng hoặc tối

source: Language
vi: Ngôn Ngữ

# language.description
source: Toggle between Vietnamese or English
vi: Thay đổi giữa tiếng Việt và tiếng Anh

source: Introduction
vi: Hướng Dẫn

# introduction.content
source: Sudoku is a logic-based, combinatorial number-placement puzzle. In classic Sudoku, the objective is to fill a 9 × 9 grid with digits so that each column, each row, and each of the nine 3 × 3 subgrids that compose the grid contain all of the digits from 1 to 9.
vi: Sudoku, ban đầu có tên gọi là Number Place là một trò chơi câu đố sắp xếp chữ số dựa trên logic theo tổ hợp. Mục tiêu của trò chơi là điền các chữ số vào một lưới 9×9 sao cho mỗi cột, mỗi hàng, và mỗi phần trong số chín lưới con 3×3 cấu tạo nên lưới chính đều chứa tất cả các chữ số từ 1 tới 9.

source: Rules
vi: Luật Chơi

# rules.content
source: 1. Sudoku grid consists of 9x9 spaces. 2. You can use only numbers from 1 to 9. 3. Each 3×3 block can only contain numbers from 1 to 9. 4. Each vertical column can only contain numbers from 1 to 9. 5. Each horizontal row can only contain numbers from 1 to 9. 6. Each number in the 3×3 block, vertical column or horizontal row can be used only once. 7. The game is over when the whole Sudoku grid is correctly filled with numbers.
vi: 1. Sudoku là câu đố trí tuệ có hình dạng lưới gồm 9x9 ô trống. 2. Bạn chỉ có thể sử dụng các số từ 1 đến 9. 3. Mỗi khối gồm 3×3 ô trống chỉ có thể chứa các số từ 1 đến 9. 4. Mỗi hàng dọc chỉ có thể chứa các số từ 1 đến 9. 5. Mỗi hàng ngang chỉ có thể chứa các số từ 1 đến 9. 6. Mỗi số trong khối 3×3, hàng dọc hoặc hàng ngang không được trùng nhau. Câu đố được giải khi điền đúng hết tất cả các số trên toàn bộ lưới Sudoku.

# difficulty.content
source: There are 3 puzzle difficulties: Easy, Medium, and Hard. The puzzles in different difficulty pools may require more techniques to solve. For each difficulty, there will be a different number of hints provided and a different number of errors allowed in that game: Easy: • Puzzle difficulty rating <= 0.45 • 5 hints provided • 10 errors allowed. Medium: • Puzzle difficulty rating between 0.45 and 0.6 • 3 hints provided • 5 errors allowed. Hard: • Puzzle difficulty rating > 0.6 • 0 hint provided • 3 errors allowed.
vi: Có 3 độ khó khác nhau: Dễ, Vừa, và cuối cùng là Khó. Độ khó càng cao thì câu đố sudoku càng khó và cần nhiều kĩ thuật hơn. Với mỗi độ khó khác nhau, người chơi sẽ được số lần gợi ý và số lần mắc lỗi giới hạn: Dễ: • Câu đố có độ khó <= 0.45 • Được 5 lần gợi ý. • Được 10 lần mắc lỗi. Vừa: • Câu đố có độ khó từ 0.45 tới 0.6 • Được 3 lần gợi ý. • Được 5 lần mắc lỗi. Khó: • Câu đố có độ khó > 0.6 • Được 0 lần gợi ý. • Được 3 lần mắc lỗi

source: Undo
vi: Đi lại

source: Hint
vi: Gợi ý

source: Error: %lld / %lld
vi: Lỗi: %lld / %lld

source: Hint: %lld / %lld
vi: Gợi ý: %lld / %lld

source: Score: %lld
vi: Điểm: %lld

source: Congratulations
vi: Xin Chúc Mừng

# rip
source: SKILL ISSUE
vi: Vấn Đề Kĩ Năng

source: Player: %@
vi: Tên: %@

source: Error: %lld
vi: Lỗi: %lld

source: Hint: %lld
vi: Gợi ý: %lld

source: Leave
vi: Quay Lại

source: Difficulty: %@
vi: Độ Khó: %@
